#ifndef ALEXNET_H
#define ALEXNET_H

#include <systemc.h>
#include <vector>
#include <string>
#include <iomanip>
#include <fstream>
#include <sstream>
#include <iostream>
#include <cmath>
#include <algorithm>

using namespace std;

// 嚙踝蕭嚙賡�佗蕭嚙踝蕭��刻�剖��頦���剖��頦���哨蕭嚙賢�鳴蕭���嚙踝蕭��佗蕭嚙踝蕭嚙踝蕭嚙踝蕭��佗蕭嚙踝蕭��刻�剖��頦���哨蕭嚙賭����剖��頦���哨蕭嚙賢�鳴蕭���嚙踝蕭���嚙賢��頦���哨蕭嚙踝蕭��佗蕭嚙踝蕭��刻�剖��頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙踝蕭���嚙�
typedef vector<vector<vector<float> > > Vector3D;
// 嚙踝蕭嚙賡�佗蕭嚙踝蕭��刻�剖��頦���剖��頦���哨蕭嚙賢�鳴蕭���嚙踝蕭��佗蕭嚙踝蕭嚙踝蕭嚙踝蕭��佗蕭嚙踝蕭��刻�剖��頦���哨蕭嚙賭����剖��頦���哨蕭嚙賢�鳴蕭���嚙踝蕭���嚙賢��頦���哨蕭嚙踝蕭��佗蕭嚙踝蕭��刻�剖��頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙踝蕭���嚙�
typedef vector<float> Vector1D;

Vector3D zero_pad(const Vector3D& input, int pad_top, int pad_left, int pad_bottom, int pad_right);
Vector3D Input(int height, int width, int channels, string file_name);
Vector3D Convolution(int num_filters, int filter_size, int stride_conv, int channels, int padding_conv, Vector3D padded_image, string conv_weight_file, string conv_bias_file);
Vector3D Max_Pooling(int num_filters, int pool_size, int stride_pool, Vector3D conv_output);
Vector1D Flatten(int num_filters, int pool_output_height, int pool_output_width, Vector3D pool_output);
Vector1D Fully_Connect(int input_size, int num_neurons, string fc_weight_file, string fc_bias_file, Vector1D fc_input);
Vector1D Soft_Max(Vector1D fc_output);
bool comparePairs(const pair<float, int>& a, const pair<float, int>& b);

// AlexNet Module
SC_MODULE(AlexNet) {
    // output port ���頦���剖��鞈∴蕭雿���剖��頦���哨蕭嚙賢�鳴蕭���嚙踝蕭���餈���剖��頦���剖��鞈ｇ蕭嚙賢��頦���哨蕭嚙踝蕭���嚙� Softmax ���頦���剖��鞈∴蕭雿���剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙踝蕭���嚙� Fully Connected Layer ���頦���剖��鞈∴蕭雿���剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙踝蕭���鞈ｇ蕭嚙賡��嚙賣����刻�剖��鞈ｇ蕭��鳴蕭���嚙踝蕭��佗蕭嚙踝蕭��刻�剖��頦���哨蕭嚙踝蕭���鞈ｇ蕭嚙賡�佗蕭嚙踝蕭���嚙踝蕭��佗蕭嚙踝蕭���嚙踝蕭�����渲�哨蕭嚙踝蕭���頦���哨蕭嚙踝蕭擗�嚙踝蕭嚙賢�刻�剖��頦���剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙踝蕭���嚙�
    sc_port<sc_fifo_out_if<float> > softmax_output_result;
    sc_port<sc_fifo_out_if<float> > fc_output_result;
    sc_port<sc_fifo_out_if<int> > num_out;
    // 嚙踝蕭嚙賡�佗蕭嚙踝蕭���嚙踝蕭�����渲�哨蕭嚙踝蕭���頦���剖��頦���哨蕭嚙踝蕭���鞈ｇ蕭��鳴蕭���嚙踝蕭��佗蕭嚙踝蕭���嚙踝蕭���嚚���剖��鞈∴蕭雿���剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙踝蕭嚙踝蕭皜莎蕭���嚙踝蕭���嚚���剖��鞈∴蕭雿���剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���剖��嚙�
    string file_name;

    SC_CTOR(AlexNet) {
        SC_THREAD(run);
    }
    void run();
};

// Monitor Module
SC_MODULE(Monitor) {
    // input port ���頦���剖��鞈∴蕭雿���剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���剖��嚙� AlexNet Module ���頦���剖��鞈∴蕭雿���剖��頦���哨蕭嚙賢�鳴蕭���嚙踝蕭��佗蕭嚙踝蕭��刻�剖��頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙踝蕭嚙踝蕭皜莎蕭���嚙踝蕭���嚚���剖��鞈∴蕭雿���剖��頦���哨蕭嚙踝蕭���頦���哨蕭嚙賭����剖��頦���剖��嚙�
    sc_port<sc_fifo_in_if<float> > in_prob;
    sc_port<sc_fifo_in_if<float> > in_value;
    sc_port<sc_fifo_in_if<int> > num_in;

    SC_CTOR(Monitor) {
        SC_THREAD(monitor_output);
    }
    void monitor_output();
};

#endif
